run/pitzDaily_kOmegaSST_LR/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       3067;
    }
    outlet
    {
        type            patch;
        nFaces          25;
        startFace       3077;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          68;
        startFace       3102;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          83;
        startFace       3170;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3160;
        startFace       3253;
    }
)

// ************************************************************************* //
